InformationRegisters/ГоспошлинаДляКлиентБанка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ГоспошлинаДляКлиентБанка</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Госпошлина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Оплачена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СудебноеДело</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ГоспошлинаДляКлиентБанка/Ext/ManagerModule.bsl
Функция НеОплаченная() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГоспошлинаДляКлиентБанкаСрезПоследних.Основание КАК Основание,
		|	ГоспошлинаДляКлиентБанкаСрезПоследних.Госпошлина КАК Госпошлина
		|ИЗ
		|	РегистрСведений.ГоспошлинаДляКлиентБанка.СрезПоследних КАК ГоспошлинаДляКлиентБанкаСрезПоследних
		|ГДЕ
		|	ГоспошлинаДляКлиентБанкаСрезПоследних.Оплачена = ЛОЖЬ";
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции // ()

Процедура ОтметитьКакОплачена(СудебныеДела) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГоспошлинаДляКлиентБанкаСрезПоследних.Основание КАК Основание,
		|	ГоспошлинаДляКлиентБанкаСрезПоследних.Госпошлина КАК Госпошлина
		|ИЗ
		|	РегистрСведений.ГоспошлинаДляКлиентБанка.СрезПоследних(, Основание В (&Основания)) КАК ГоспошлинаДляКлиентБанкаСрезПоследних
		|ГДЕ
		|	ГоспошлинаДляКлиентБанкаСрезПоследних.Оплачена = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Основания", СудебныеДела);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ДатаЗаписи = ТекущаяДатаСеанса();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Запись = СоздатьМенеджерЗаписи();
		Запись.Период = ДатаЗаписи;
		Запись.Основание = ВыборкаДетальныеЗаписи.Основание;
		Запись.Госпошлина = ВыборкаДетальныеЗаписи.Госпошлина;
		Запись.Оплачена = Истина;
		
		Запись.Записать();
		
	КонецЦикла;

КонецПроцедуры
